src/Catalogs/ИдентификаторыСтрокЗаявок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ИдентификаторыСтрокЗаявок</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Заявка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаПокупателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоследняяКорректировка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.КорректировкаЗаявкиПокупателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IDSite</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрайсПоставщика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрайсыПоставщиков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокГарантированный</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокОжидаемый</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокГарантированныйЗаказа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокОжидаемыйЗаказа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаЗакупки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСостояниеЗаказа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеЗаявки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Виртуальная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаршрутДоставки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МаршрутыДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИзготовительПоставщика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АртикулПоставщика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПоставки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипПоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Enums/ТипПоставки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ТипПоставки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Кросс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сток</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>VMI</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/ИдентификаторыСтрокЗаявок/Ext/ManagerModule.bsl
// ЛНА
Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Поля.Добавить("ТипПоставки");
	Поля.Добавить("Наименование");
	Поля.Добавить("IDSite");
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)	
	СтандартнаяОбработка = Ложь;
	
	СтрокаТипПоставки = "";
	Если ЗначениеЗаполнено(Данные.ТипПоставки) Тогда
		
		лСоответствие = Новый Соответствие;
		лСоответствие.Вставить(Перечисления.ТипПоставки.Сток,	"[C] ");
		лСоответствие.Вставить(Перечисления.ТипПоставки.Кросс,	"[К] ");
		лСоответствие.Вставить(Перечисления.ТипПоставки.VMI,	"[V] ");
		лСоответствие.Вставить(Перечисления.ТипПоставки.ПополнениеСклада, "[П] ");
		
		СтрокаТипПоставки = лСоответствие.Получить(Данные.ТипПоставки);		
	КонецЕсли;
	
	СтрокаНаименование = Данные.Наименование;
	Если ЗначениеЗаполнено(Данные.IDSite) 
		И СтрДлина(СокрЛП(Данные.IDSite)) < 20 Тогда
		
		СтрокаНаименование = Данные.IDSite;
	КонецЕсли;	
	
	Представление = СтрокаТипПоставки + СтрокаНаименование;
КонецПроцедуры

// ЛНА http://jira.part-kom.ru/browse/XX-1641
// Функция получает тип поставки для Идентификатора строки заявки
//
// Параметры:
//  <ИдентификаторСтрокиЗаявки>  - Ссылка или Объект Справочник.ИдентификаторыСтрокЗаявок
//  <Заявка>  - Ссылка или Объект Документ.ЗаявкаПокупаетля или Корректировка
//  <Прайс>  - Ссылка  ПрайсыПоставщиков
// 	<КэшДанных> - РеквизитыПоставщика при вызове из КорректировкаЗаявкиПокупателя модуль менеджера
Функция ПолучитьТипПоставки(ИдентификаторСтрокиЗаявки, Заявка, Прайс, КэшДанных = Неопределено) Экспорт	

	лКлючАлгоритма = "Справочник_ИдентификаторыСтрокЗаявок_МодульМенеджера_ПолучитьТипПоставки";
	 лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	 Если Не лЗамена = Неопределено Тогда
	 	АлгоритмыЗначениеВозврата = Неопределено;		
	 	Выполнить(лЗамена);		
	 	Возврат АлгоритмыЗначениеВозврата;		
	 КонецЕсли;	
	 ////////////////////////////////////////////////
	
	
	//Если Не КэшДанных = Неопределено Тогда		
	//	ЗначениеРеквизитов = КэшДанных[ИдентификаторСтрокиЗаявки.IDSite];
	//	Возврат  ЗначениеРеквизитов.ТипПоставки;		
	//КонецЕсли;
	
	//#XX-1961 Kalinin V.A. ( 2019-02-13 )
	  // Закоментировал
	//Если ЗначениеЗаполнено(ИдентификаторСтрокиЗаявки.ТипПоставки) Тогда
	//	Возврат ИдентификаторСтрокиЗаявки.ТипПоставки;
	//КонецЕсли;
	
	Результат = Неопределено;
	
	Если //ЗначениеЗаполнено(Заявка) И 
		ЗначениеЗаполнено(Заявка.Контрагент) И  
		ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Заявка.Контрагент,"Родитель") = ПредопределенноеЗначение("Справочник.Контрагенты.ПополнениеМинимальныхОстатков")  тогда 
		
		//ЗначениеЗаполнено(Заявка.Контрагент.Родитель) = Заявка.Контрагент.Родитель = "00005396" Тогда		
		//Папка "Пополнение мин.остатков"
		Результат = Перечисления.ТипПоставки.ПополнениеСклада;
	ИначеЕсли Прайс.Пустая() Тогда
		Результат = Перечисления.ТипПоставки.Сток;
	ИначеЕсли Прайс.Склад.Пустая() Тогда
		Результат = Перечисления.ТипПоставки.Кросс;
	ИначеЕсли Прайс.Склад.СкладVMI Тогда
		Результат = Перечисления.ТипПоставки.VMI;
	Иначе
		Результат = Перечисления.ТипПоставки.Сток;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
